# IsValidSymbol Method (ForgeTypeId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormatOptions..::..IsValidSymbol Method (ForgeTypeId)
FormatOptions Class See Also
---
Checks whether a symbol is valid for the unit in this FormatOptions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsValidSymbol(
	ForgeTypeId symbolTypeId
)
```

Visual Basic
---
```text
Public Function IsValidSymbol ( _
	symbolTypeId As ForgeTypeId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidSymbol(
	ForgeTypeId^ symbolTypeId
)
```

# ### Parameters
symbolTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId Identifier of the symbol to check.
# ### Return Value
True if the symbol is valid, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | UseDefault is true in this FormatOptions. |

# See Also
FormatOptions Class
IsValidSymbol Overload
Autodesk.Revit.DB Namespace